FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/i2c_reg.h
#define I2C_CTL0_SI_Pos             ( 3 )                                                  /*!< I2C_T::CTL0: SI Position               */
#define I2C_CTL0_SI_Msk             ( 0x1ul << I2C_CTL0_SI_Pos )                           /*!< I2C_T::CTL0: SI Mask                   */

#define I2C_CTL0_STO_Pos            ( 4 )                                                  /*!< I2C_T::CTL0: STO Position              */
#define I2C_CTL0_STO_Msk            ( 0x1ul << I2C_CTL0_STO_Pos )                          /*!< I2C_T::CTL0: STO Mask                  */

#define I2C_CTL0_STA_Pos            ( 5 )                                                  /*!< I2C_T::CTL0: STA Position              */
#define I2C_CTL0_STA_Msk            ( 0x1ul << I2C_CTL0_STA_Pos )                          /*!< I2C_T::CTL0: STA Mask                  */

#define I2C_CTL0_I2CEN_Pos          ( 6 )                                                  /*!< I2C_T::CTL0: I2CEN Position            */
#define I2C_CTL0_I2CEN_Msk          ( 0x1ul << I2C_CTL0_I2CEN_Pos )                        /*!< I2C_T::CTL0: I2CEN Mask                */

#define I2C_CTL0_INTEN_Pos          ( 7 )                                                  /*!< I2C_T::CTL0: INTEN Position            */
#define I2C_CTL0_INTEN_Msk          ( 0x1ul << I2C_CTL0_INTEN_Pos )                        /*!< I2C_T::CTL0: INTEN Mask                */

#define I2C_ADDR0_GC_Pos            ( 0 )                                                  /*!< I2C_T::ADDR0: GC Position              */
#define I2C_ADDR0_GC_Msk            ( 0x1ul << I2C_ADDR0_GC_Pos )                          /*!< I2C_T::ADDR0: GC Mask                  */

#define I2C_ADDR0_ADDR_Pos          ( 1 )                                                  /*!< I2C_T::ADDR0: ADDR Position            */
#define I2C_ADDR0_ADDR_Msk          ( 0x3fful << I2C_ADDR0_ADDR_Pos )                      /*!< I2C_T::ADDR0: ADDR Mask                */

#define I2C_DAT_DAT_Pos             ( 0 )                                                  /*!< I2C_T::DAT: DAT Position               */
#define I2C_DAT_DAT_Msk             ( 0xfful << I2C_DAT_DAT_Pos )                          /*!< I2C_T::DAT: DAT Mask                   */

#define I2C_STATUS0_STATUS_Pos      ( 0 )                                                  /*!< I2C_T::STATUS0: STATUS Position        */
#define I2C_STATUS0_STATUS_Msk      ( 0xfful << I2C_STATUS0_STATUS_Pos )                   /*!< I2C_T::STATUS0: STATUS Mask            */

#define I2C_CLKDIV_DIVIDER_Pos      ( 0 )                                                  /*!< I2C_T::CLKDIV: DIVIDER Position        */
#define I2C_CLKDIV_DIVIDER_Msk      ( 0x3fful << I2C_CLKDIV_DIVIDER_Pos )                  /*!< I2C_T::CLKDIV: DIVIDER Mask            */

#define I2C_TOCTL_TOIF_Pos          ( 0 )                                                  /*!< I2C_T::TOCTL: TOIF Position            */
#define I2C_TOCTL_TOIF_Msk          ( 0x1ul << I2C_TOCTL_TOIF_Pos )                        /*!< I2C_T::TOCTL: TOIF Mask                */

#define I2C_TOCTL_TOCDIV4_Pos       ( 1 )                                                  /*!< I2C_T::TOCTL: TOCDIV4 Position         */
#define I2C_TOCTL_TOCDIV4_Msk       ( 0x1ul << I2C_TOCTL_TOCDIV4_Pos )                     /*!< I2C_T::TOCTL: TOCDIV4 Mask             */

#define I2C_TOCTL_TOCEN_Pos         ( 2 )                                                  /*!< I2C_T::TOCTL: TOCEN Position           */
#define I2C_TOCTL_TOCEN_Msk         ( 0x1ul << I2C_TOCTL_TOCEN_Pos )                       /*!< I2C_T::TOCTL: TOCEN Mask               */

#define I2C_ADDR1_GC_Pos            ( 0 )                                                  /*!< I2C_T::ADDR1: GC Position              */
#define I2C_ADDR1_GC_Msk            ( 0x1ul << I2C_ADDR1_GC_Pos )                          /*!< I2C_T::ADDR1: GC Mask                  */

#define I2C_ADDR1_ADDR_Pos          ( 1 )                                                  /*!< I2C_T::ADDR1: ADDR Position            */
#define I2C_ADDR1_ADDR_Msk          ( 0x3fful << I2C_ADDR1_ADDR_Pos )                      /*!< I2C_T::ADDR1: ADDR Mask                */

#define I2C_ADDR2_GC_Pos            ( 0 )                                                  /*!< I2C_T::ADDR2: GC Position              */
#define I2C_ADDR2_GC_Msk            ( 0x1ul << I2C_ADDR2_GC_Pos )                          /*!< I2C_T::ADDR2: GC Mask                  */

#define I2C_ADDR2_ADDR_Pos          ( 1 )                                                  /*!< I2C_T::ADDR2: ADDR Position            */
#define I2C_ADDR2_ADDR_Msk          ( 0x3fful << I2C_ADDR2_ADDR_Pos )                      /*!< I2C_T::ADDR2: ADDR Mask                */

#define I2C_ADDR3_GC_Pos            ( 0 )                                                  /*!< I2C_T::ADDR3: GC Position              */
#define I2C_ADDR3_GC_Msk            ( 0x1ul << I2C_ADDR3_GC_Pos )                          /*!< I2C_T::ADDR3: GC Mask                  */

#define I2C_ADDR3_ADDR_Pos          ( 1 )                                                  /*!< I2C_T::ADDR3: ADDR Position            */
#define I2C_ADDR3_ADDR_Msk          ( 0x3fful << I2C_ADDR3_ADDR_Pos )                      /*!< I2C_T::ADDR3: ADDR Mask                */

#define I2C_ADDRMSK0_ADDRMSK_Pos    ( 1 )                                                  /*!< I2C_T::ADDRMSK0: ADDRMSK Position      */
#define I2C_ADDRMSK0_ADDRMSK_Msk    ( 0x3fful << I2C_ADDRMSK0_ADDRMSK_Pos )                /*!< I2C_T::ADDRMSK0: ADDRMSK Mask          */

#define I2C_ADDRMSK1_ADDRMSK_Pos    ( 1 )                                                  /*!< I2C_T::ADDRMSK1: ADDRMSK Position      */
#define I2C_ADDRMSK1_ADDRMSK_Msk    ( 0x3fful << I2C_ADDRMSK1_ADDRMSK_Pos )                /*!< I2C_T::ADDRMSK1: ADDRMSK Mask          */

#define I2C_ADDRMSK2_ADDRMSK_Pos    ( 1 )                                                  /*!< I2C_T::ADDRMSK2: ADDRMSK Position      */
#define I2C_ADDRMSK2_ADDRMSK_Msk    ( 0x3fful << I2C_ADDRMSK2_ADDRMSK_Pos )                /*!< I2C_T::ADDRMSK2: ADDRMSK Mask          */

