FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/i2c_reg.h
#define I2C_ADDRMSK3_ADDRMSK_Pos    ( 1 )                                                  /*!< I2C_T::ADDRMSK3: ADDRMSK Position      */
#define I2C_ADDRMSK3_ADDRMSK_Msk    ( 0x3fful << I2C_ADDRMSK3_ADDRMSK_Pos )                /*!< I2C_T::ADDRMSK3: ADDRMSK Mask          */

#define I2C_WKCTL_WKEN_Pos          ( 0 )                                                  /*!< I2C_T::WKCTL: WKEN Position            */
#define I2C_WKCTL_WKEN_Msk          ( 0x1ul << I2C_WKCTL_WKEN_Pos )                        /*!< I2C_T::WKCTL: WKEN Mask                */

#define I2C_WKCTL_NHDBUSEN_Pos      ( 7 )                                                  /*!< I2C_T::WKCTL: NHDBUSEN Position        */
#define I2C_WKCTL_NHDBUSEN_Msk      ( 0x1ul << I2C_WKCTL_NHDBUSEN_Pos )                    /*!< I2C_T::WKCTL: NHDBUSEN Mask            */

#define I2C_WKSTS_WKIF_Pos          ( 0 )                                                  /*!< I2C_T::WKSTS: WKIF Position            */
#define I2C_WKSTS_WKIF_Msk          ( 0x1ul << I2C_WKSTS_WKIF_Pos )                        /*!< I2C_T::WKSTS: WKIF Mask                */

#define I2C_WKSTS_WKAKDONE_Pos      ( 1 )                                                  /*!< I2C_T::WKSTS: WKAKDONE Position        */
#define I2C_WKSTS_WKAKDONE_Msk      ( 0x1ul << I2C_WKSTS_WKAKDONE_Pos )                    /*!< I2C_T::WKSTS: WKAKDONE Mask            */

#define I2C_WKSTS_WRSTSWK_Pos       ( 2 )                                                  /*!< I2C_T::WKSTS: WRSTSWK Position         */
#define I2C_WKSTS_WRSTSWK_Msk       ( 0x1ul << I2C_WKSTS_WRSTSWK_Pos )                     /*!< I2C_T::WKSTS: WRSTSWK Mask             */

#define I2C_CTL1_TXPDMAEN_Pos       ( 0 )                                                  /*!< I2C_T::CTL1: TXPDMAEN Position         */
#define I2C_CTL1_TXPDMAEN_Msk       ( 0x1ul << I2C_CTL1_TXPDMAEN_Pos )                     /*!< I2C_T::CTL1: TXPDMAEN Mask             */

#define I2C_CTL1_RXPDMAEN_Pos       ( 1 )                                                  /*!< I2C_T::CTL1: RXPDMAEN Position         */
#define I2C_CTL1_RXPDMAEN_Msk       ( 0x1ul << I2C_CTL1_RXPDMAEN_Pos )                     /*!< I2C_T::CTL1: RXPDMAEN Mask             */

#define I2C_CTL1_PDMARST_Pos        ( 2 )                                                  /*!< I2C_T::CTL1: PDMARST Position          */
#define I2C_CTL1_PDMARST_Msk        ( 0x1ul << I2C_CTL1_PDMARST_Pos )                      /*!< I2C_T::CTL1: PDMARST Mask              */

#define I2C_CTL1_PDMASTR_Pos        ( 8 )                                                  /*!< I2C_T::CTL1: PDMASTR Position          */
#define I2C_CTL1_PDMASTR_Msk        ( 0x1ul << I2C_CTL1_PDMASTR_Pos )                      /*!< I2C_T::CTL1: PDMASTR Mask              */

#define I2C_CTL1_ADDR10EN_Pos       ( 9 )                                                  /*!< I2C_T::CTL1: ADDR10EN Position         */
#define I2C_CTL1_ADDR10EN_Msk       ( 0x1ul << I2C_CTL1_ADDR10EN_Pos )                     /*!< I2C_T::CTL1: ADDR10EN Mask             */

#define I2C_STATUS1_ADMAT0_Pos      ( 0 )                                                  /*!< I2C_T::STATUS1: ADMAT0 Position        */
#define I2C_STATUS1_ADMAT0_Msk      ( 0x1ul << I2C_STATUS1_ADMAT0_Pos )                    /*!< I2C_T::STATUS1: ADMAT0 Mask            */

#define I2C_STATUS1_ADMAT1_Pos      ( 1 )                                                  /*!< I2C_T::STATUS1: ADMAT1 Position        */
#define I2C_STATUS1_ADMAT1_Msk      ( 0x1ul << I2C_STATUS1_ADMAT1_Pos )                    /*!< I2C_T::STATUS1: ADMAT1 Mask            */

#define I2C_STATUS1_ADMAT2_Pos      ( 2 )                                                  /*!< I2C_T::STATUS1: ADMAT2 Position        */
#define I2C_STATUS1_ADMAT2_Msk      ( 0x1ul << I2C_STATUS1_ADMAT2_Pos )                    /*!< I2C_T::STATUS1: ADMAT2 Mask            */

#define I2C_STATUS1_ADMAT3_Pos      ( 3 )                                                  /*!< I2C_T::STATUS1: ADMAT3 Position        */
#define I2C_STATUS1_ADMAT3_Msk      ( 0x1ul << I2C_STATUS1_ADMAT3_Pos )                    /*!< I2C_T::STATUS1: ADMAT3 Mask            */

#define I2C_STATUS1_ONBUSY_Pos      ( 8 )                                                  /*!< I2C_T::STATUS1: ONBUSY Position        */
#define I2C_STATUS1_ONBUSY_Msk      ( 0x1ul << I2C_STATUS1_ONBUSY_Pos )                    /*!< I2C_T::STATUS1: ONBUSY Mask            */

#define I2C_TMCTL_STCTL_Pos         ( 0 )                                                  /*!< I2C_T::TMCTL: STCTL Position           */
#define I2C_TMCTL_STCTL_Msk         ( 0x1fful << I2C_TMCTL_STCTL_Pos )                     /*!< I2C_T::TMCTL: STCTL Mask               */

#define I2C_TMCTL_HTCTL_Pos         ( 16 )                                                 /*!< I2C_T::TMCTL: HTCTL Position           */
#define I2C_TMCTL_HTCTL_Msk         ( 0x1fful << I2C_TMCTL_HTCTL_Pos )                     /*!< I2C_T::TMCTL: HTCTL Mask               */

#define I2C_BUSCTL_ACKMEN_Pos       ( 0 )                                                  /*!< I2C_T::BUSCTL: ACKMEN Position         */
#define I2C_BUSCTL_ACKMEN_Msk       ( 0x1ul << I2C_BUSCTL_ACKMEN_Pos )                     /*!< I2C_T::BUSCTL: ACKMEN Mask             */

#define I2C_BUSCTL_PECEN_Pos        ( 1 )                                                  /*!< I2C_T::BUSCTL: PECEN Position          */
#define I2C_BUSCTL_PECEN_Msk        ( 0x1ul << I2C_BUSCTL_PECEN_Pos )                      /*!< I2C_T::BUSCTL: PECEN Mask              */

#define I2C_BUSCTL_BMDEN_Pos        ( 2 )                                                  /*!< I2C_T::BUSCTL: BMDEN Position          */
#define I2C_BUSCTL_BMDEN_Msk        ( 0x1ul << I2C_BUSCTL_BMDEN_Pos )                      /*!< I2C_T::BUSCTL: BMDEN Mask              */

#define I2C_BUSCTL_BMHEN_Pos        ( 3 )                                                  /*!< I2C_T::BUSCTL: BMHEN Position          */
#define I2C_BUSCTL_BMHEN_Msk        ( 0x1ul << I2C_BUSCTL_BMHEN_Pos )                      /*!< I2C_T::BUSCTL: BMHEN Mask              */

#define I2C_BUSCTL_ALERTEN_Pos      ( 4 )                                                  /*!< I2C_T::BUSCTL: ALERTEN Position        */
#define I2C_BUSCTL_ALERTEN_Msk      ( 0x1ul << I2C_BUSCTL_ALERTEN_Pos )                    /*!< I2C_T::BUSCTL: ALERTEN Mask            */

#define I2C_BUSCTL_SCTLOSTS_Pos     ( 5 )                                                  /*!< I2C_T::BUSCTL: SCTLOSTS Position       */
#define I2C_BUSCTL_SCTLOSTS_Msk     ( 0x1ul << I2C_BUSCTL_SCTLOSTS_Pos )                   /*!< I2C_T::BUSCTL: SCTLOSTS Mask           */

