FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_MPU_M23_Nuvoton_NuMaker_PFM_M2351_IAR_GCC/Nuvoton_Code/Device/Nuvoton/M2351/Include/i2c_reg.h
#define I2C_BUSCTL_SCTLOEN_Pos      ( 6 )                                                  /*!< I2C_T::BUSCTL: SCTLOEN Position        */
#define I2C_BUSCTL_SCTLOEN_Msk      ( 0x1ul << I2C_BUSCTL_SCTLOEN_Pos )                    /*!< I2C_T::BUSCTL: SCTLOEN Mask            */

#define I2C_BUSCTL_BUSEN_Pos        ( 7 )                                                  /*!< I2C_T::BUSCTL: BUSEN Position          */
#define I2C_BUSCTL_BUSEN_Msk        ( 0x1ul << I2C_BUSCTL_BUSEN_Pos )                      /*!< I2C_T::BUSCTL: BUSEN Mask              */

#define I2C_BUSCTL_PECTXEN_Pos      ( 8 )                                                  /*!< I2C_T::BUSCTL: PECTXEN Position        */
#define I2C_BUSCTL_PECTXEN_Msk      ( 0x1ul << I2C_BUSCTL_PECTXEN_Pos )                    /*!< I2C_T::BUSCTL: PECTXEN Mask            */

#define I2C_BUSCTL_TIDLE_Pos        ( 9 )                                                  /*!< I2C_T::BUSCTL: TIDLE Position          */
#define I2C_BUSCTL_TIDLE_Msk        ( 0x1ul << I2C_BUSCTL_TIDLE_Pos )                      /*!< I2C_T::BUSCTL: TIDLE Mask              */

#define I2C_BUSCTL_PECCLR_Pos       ( 10 )                                                 /*!< I2C_T::BUSCTL: PECCLR Position         */
#define I2C_BUSCTL_PECCLR_Msk       ( 0x1ul << I2C_BUSCTL_PECCLR_Pos )                     /*!< I2C_T::BUSCTL: PECCLR Mask             */

#define I2C_BUSCTL_ACKM9SI_Pos      ( 11 )                                                 /*!< I2C_T::BUSCTL: ACKM9SI Position        */
#define I2C_BUSCTL_ACKM9SI_Msk      ( 0x1ul << I2C_BUSCTL_ACKM9SI_Pos )                    /*!< I2C_T::BUSCTL: ACKM9SI Mask            */

#define I2C_BUSCTL_BCDIEN_Pos       ( 12 )                                                 /*!< I2C_T::BUSCTL: BCDIEN Position         */
#define I2C_BUSCTL_BCDIEN_Msk       ( 0x1ul << I2C_BUSCTL_BCDIEN_Pos )                     /*!< I2C_T::BUSCTL: BCDIEN Mask             */

#define I2C_BUSCTL_PECDIEN_Pos      ( 13 )                                                 /*!< I2C_T::BUSCTL: PECDIEN Position        */
#define I2C_BUSCTL_PECDIEN_Msk      ( 0x1ul << I2C_BUSCTL_PECDIEN_Pos )                    /*!< I2C_T::BUSCTL: PECDIEN Mask            */

#define I2C_BUSTCTL_BUSTOEN_Pos     ( 0 )                                                  /*!< I2C_T::BUSTCTL: BUSTOEN Position       */
#define I2C_BUSTCTL_BUSTOEN_Msk     ( 0x1ul << I2C_BUSTCTL_BUSTOEN_Pos )                   /*!< I2C_T::BUSTCTL: BUSTOEN Mask           */

#define I2C_BUSTCTL_CLKTOEN_Pos     ( 1 )                                                  /*!< I2C_T::BUSTCTL: CLKTOEN Position       */
#define I2C_BUSTCTL_CLKTOEN_Msk     ( 0x1ul << I2C_BUSTCTL_CLKTOEN_Pos )                   /*!< I2C_T::BUSTCTL: CLKTOEN Mask           */

#define I2C_BUSTCTL_BUSTOIEN_Pos    ( 2 )                                                  /*!< I2C_T::BUSTCTL: BUSTOIEN Position      */
#define I2C_BUSTCTL_BUSTOIEN_Msk    ( 0x1ul << I2C_BUSTCTL_BUSTOIEN_Pos )                  /*!< I2C_T::BUSTCTL: BUSTOIEN Mask          */

#define I2C_BUSTCTL_CLKTOIEN_Pos    ( 3 )                                                  /*!< I2C_T::BUSTCTL: CLKTOIEN Position      */
#define I2C_BUSTCTL_CLKTOIEN_Msk    ( 0x1ul << I2C_BUSTCTL_CLKTOIEN_Pos )                  /*!< I2C_T::BUSTCTL: CLKTOIEN Mask          */

#define I2C_BUSTCTL_TORSTEN_Pos     ( 4 )                                                  /*!< I2C_T::BUSTCTL: TORSTEN Position       */
#define I2C_BUSTCTL_TORSTEN_Msk     ( 0x1ul << I2C_BUSTCTL_TORSTEN_Pos )                   /*!< I2C_T::BUSTCTL: TORSTEN Mask           */

#define I2C_BUSSTS_BUSY_Pos         ( 0 )                                                  /*!< I2C_T::BUSSTS: BUSY Position           */
#define I2C_BUSSTS_BUSY_Msk         ( 0x1ul << I2C_BUSSTS_BUSY_Pos )                       /*!< I2C_T::BUSSTS: BUSY Mask               */

#define I2C_BUSSTS_BCDONE_Pos       ( 1 )                                                  /*!< I2C_T::BUSSTS: BCDONE Position         */
#define I2C_BUSSTS_BCDONE_Msk       ( 0x1ul << I2C_BUSSTS_BCDONE_Pos )                     /*!< I2C_T::BUSSTS: BCDONE Mask             */

#define I2C_BUSSTS_PECERR_Pos       ( 2 )                                                  /*!< I2C_T::BUSSTS: PECERR Position         */
#define I2C_BUSSTS_PECERR_Msk       ( 0x1ul << I2C_BUSSTS_PECERR_Pos )                     /*!< I2C_T::BUSSTS: PECERR Mask             */

#define I2C_BUSSTS_ALERT_Pos        ( 3 )                                                  /*!< I2C_T::BUSSTS: ALERT Position          */
#define I2C_BUSSTS_ALERT_Msk        ( 0x1ul << I2C_BUSSTS_ALERT_Pos )                      /*!< I2C_T::BUSSTS: ALERT Mask              */

#define I2C_BUSSTS_SCTLDIN_Pos      ( 4 )                                                  /*!< I2C_T::BUSSTS: SCTLDIN Position        */
#define I2C_BUSSTS_SCTLDIN_Msk      ( 0x1ul << I2C_BUSSTS_SCTLDIN_Pos )                    /*!< I2C_T::BUSSTS: SCTLDIN Mask            */

#define I2C_BUSSTS_BUSTO_Pos        ( 5 )                                                  /*!< I2C_T::BUSSTS: BUSTO Position          */
#define I2C_BUSSTS_BUSTO_Msk        ( 0x1ul << I2C_BUSSTS_BUSTO_Pos )                      /*!< I2C_T::BUSSTS: BUSTO Mask              */

#define I2C_BUSSTS_CLKTO_Pos        ( 6 )                                                  /*!< I2C_T::BUSSTS: CLKTO Position          */
#define I2C_BUSSTS_CLKTO_Msk        ( 0x1ul << I2C_BUSSTS_CLKTO_Pos )                      /*!< I2C_T::BUSSTS: CLKTO Mask              */

#define I2C_BUSSTS_PECDONE_Pos      ( 7 )                                                  /*!< I2C_T::BUSSTS: PECDONE Position        */
#define I2C_BUSSTS_PECDONE_Msk      ( 0x1ul << I2C_BUSSTS_PECDONE_Pos )                    /*!< I2C_T::BUSSTS: PECDONE Mask            */

#define I2C_PKTSIZE_PLDSIZE_Pos     ( 0 )                                                  /*!< I2C_T::PKTSIZE: PLDSIZE Position       */
#define I2C_PKTSIZE_PLDSIZE_Msk     ( 0x1fful << I2C_PKTSIZE_PLDSIZE_Pos )                 /*!< I2C_T::PKTSIZE: PLDSIZE Mask           */

#define I2C_PKTCRC_PECCRC_Pos       ( 0 )                                                  /*!< I2C_T::PKTCRC: PECCRC Position         */
#define I2C_PKTCRC_PECCRC_Msk       ( 0xfful << I2C_PKTCRC_PECCRC_Pos )                    /*!< I2C_T::PKTCRC: PECCRC Mask             */

#define I2C_BUSTOUT_BUSTO_Pos       ( 0 )                                                  /*!< I2C_T::BUSTOUT: BUSTO Position         */
#define I2C_BUSTOUT_BUSTO_Msk       ( 0xfful << I2C_BUSTOUT_BUSTO_Pos )                    /*!< I2C_T::BUSTOUT: BUSTO Mask             */

#define I2C_CLKTOUT_CLKTO_Pos       ( 0 )                                                  /*!< I2C_T::CLKTOUT: CLKTO Position         */
#define I2C_CLKTOUT_CLKTO_Msk       ( 0xfful << I2C_CLKTOUT_CLKTO_Pos )                    /*!< I2C_T::CLKTOUT: CLKTO Mask             */

/**@}*/ /* I2C_CONST */
/**@}*/ /* end of I2C register group */
/**@}*/ /* end of REGISTER group */


#endif /* __I2C_REG_H__ */
